# frozen_string_literal: true

tap 'homebrew/bundle'
tap 'buo/cask-upgrade'
tap 'homebrew/cask-fonts'

brew 'bat' # Better cat
brew 'curl'
brew 'fzf' # Fuzzy finder (to improve ctrl+R searches)
brew 'git'
brew 'git-delta'
brew 'gh'
brew 'github-keygen'
brew 'lazygit'
brew 'openssl'
brew 'overmind' # Running multiple processes
brew 'postgresql@14'
brew 'pyenv'
brew 'python@3.11'
brew 'rbenv' # ruby version manager
brew 'readline'
brew 'ripgrep'
brew 'ruby-build'
brew 'smug'
brew 'spaceship'
brew 'tmux' # Terminal multiplexer
brew 'wget'
brew 'zsh-syntax-highlighting'

# Fonts
cask 'font-meslo-for-powerline'
cask 'font-daddy-time-mono-nerd-font'
cask 'font-jetbrains-mono-nerd-font'

# Utility apps
cask 'hiddenbar' # Hide items in top menu bar
cask 'numi' # Improved calculator
