# frozen_string_literal: true

tap 'homebrew/bundle'
tap 'buo/cask-upgrade'

brew 'bat' # Better cat
brew 'curl'
brew 'fzf' # Fuzzy finder (to improve ctrl+R searches)
brew 'git'
brew 'git-delta' # Pretty git diffs
brew 'mole' # Deep-clean macbook
brew 'monolith' # Save websites!
brew 'openssl'
brew 'overmind' # Running multiple processes
brew 'postgresql@16'
brew 'pyenv'
brew 'python@3.11'
brew 'rbenv' # ruby version manager
brew 'readline' # Readline library, required for ruby history on mac
brew 'ruby-build'
brew 'spaceship' # Tmux plugin
brew 'tmux' # Terminal multiplexer
brew 'zsh-syntax-highlighting'

# Utility apps
cask 'hiddenbar' # Hide items in top menu bar
cask 'numi' # Improved calculator
cask 'visual-studio-code' # Duh

tap 'gleich/homebrew-taps'
brew 'nuke' # Close all apps in one command
