# frozen_string_literal: true

tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'buo/cask-upgrade'
tap 'homebrew/cask-fonts'

brew 'bat'
brew 'curl'
brew 'fzf'
brew 'git'
brew 'git-delta'
brew 'gh'
brew 'github-keygen'
brew 'lazygit'
brew 'openssl'
brew 'overmind'
brew 'postgresql@14'
brew 'python@3.11'
brew 'rbenv'
brew 'readline'
brew 'ripgrep'
brew 'ruby-build'
brew 'tmux'
brew 'smug'
brew 'wget'

# Fonts
cask 'font-meslo-for-powerline'
cask 'font-daddy-time-mono-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
